{
  "project": "VST3MCPWrapper",
  "branchName": "ralph/hardening",
  "description": "Codebase Hardening — Fix bugs, improve robustness, expand test coverage, and clean up dead code before public release",
  "userStories": [
    {
      "id": "US-001",
      "title": "Validate NaN/Inf in set_parameter MCP tool",
      "description": "As a developer, I want the set_parameter tool to reject NaN and Infinity values so that invalid floats never reach the audio processor.",
      "acceptanceCriteria": [
        "handleSetParameter() checks std::isfinite(value) before clamping",
        "If value is NaN or Inf, return isError: true with a descriptive message",
        "Add unit tests in test_mcp_param_tools.cpp: NaN returns error, +Inf returns error, -Inf returns error",
        "Existing set_parameter tests still pass",
        "Build compiles without errors, all tests pass"
      ],
      "priority": 1,
      "passes": true,
      "notes": "std::clamp with NaN returns NaN (comparisons with NaN are always false). This NaN would propagate to setParamNormalized() and the audio processor. Add #include <cmath> if not already present for std::isfinite()."
    },
    {
      "id": "US-002",
      "title": "Add error handling for MCP server start failure",
      "description": "As a developer, I want the MCP server start to be wrapped in a try-catch so that a port conflict doesn't crash the DAW.",
      "acceptanceCriteria": [
        "Controller::startMCPServer() (or MCPServer::start()) wraps the server start in a try-catch",
        "On failure, logs the error to stderr with fprintf and resets mcpServer_ to nullptr",
        "The plugin continues to function (audio passthrough) even if the MCP server fails to start",
        "Add a test in test_mcp_server_integration.cpp that verifies binding to an already-in-use port doesn't crash (start two servers on the same port, second should fail gracefully)",
        "Build compiles without errors, all tests pass"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Currently if mcp::server::start() throws (e.g., port 8771 already in use), the exception propagates uncaught. The MCP server is non-critical — audio passthrough should always work. Use fprintf(stderr, ...) for logging (not os_log, which is macOS-only)."
    },
    {
      "id": "US-003",
      "title": "Add null guard for message binary data in Processor::notify",
      "description": "As a developer, I want explicit null pointer checks when extracting binary data from IMessage attributes so that a malformed message can't cause undefined behavior.",
      "acceptanceCriteria": [
        "In Processor::notify(), after getBinary() returns kResultOk, check that data pointer is not nullptr before constructing std::string",
        "If data is nullptr despite kResultOk, skip the operation (log warning to stderr)",
        "Add a unit test in test_message_routing.cpp that sends a message with getBinary returning kResultOk but data=nullptr, verify no crash",
        "Existing message routing tests still pass",
        "Build compiles without errors, all tests pass"
      ],
      "priority": 3,
      "passes": true,
      "notes": "In processor.cpp notify(), std::string(static_cast<const char*>(data), size) is UB if data is nullptr. The VST3 SDK should guarantee this doesn't happen, but defense-in-depth is warranted. The mock in tests/mocks/mock_vst3.h may need to be extended to support returning nullptr from getBinary."
    },
    {
      "id": "US-004",
      "title": "Remove placeholder test and verify test_mock_vst3 provides value",
      "description": "As a developer, I want to remove the placeholder test and ensure mock tests are meaningful so that the test suite is clean and trustworthy.",
      "acceptanceCriteria": [
        "Remove test_placeholder.cpp entirely from tests/ and from tests/CMakeLists.txt",
        "Review test_mock_vst3.cpp — if tests only check instantiation and trivial ref counting, either add meaningful queryInterface tests or remove the file",
        "If test_mock_vst3.cpp is kept, add tests that verify: queryInterface returns correct interfaces, queryInterface for unsupported IID returns kNoInterface, ref counting starts at 1",
        "Build compiles without errors, all tests pass",
        "Total test count may decrease (placeholder removed) but remaining tests are meaningful"
      ],
      "priority": 4,
      "passes": true,
      "notes": "test_placeholder.cpp tests 1+1=2 — this was a scaffolding test from initial setup and has no value. test_mock_vst3.cpp only tests instantiation — these mocks are used by other tests, so the mock test file may be worth keeping if it verifies the mocks themselves behave correctly (especially queryInterface routing)."
    },
    {
      "id": "US-005",
      "title": "Test DAW automation + MCP parameter change merging",
      "description": "As a developer, I want tests that verify the processor correctly merges DAW automation changes with MCP-queued parameter changes during process().",
      "acceptanceCriteria": [
        "Add tests in test_processor_process.cpp (or a new file if cleaner)",
        "Test: When DAW provides inputParameterChanges AND the MCP queue has changes for different parameters, both appear in the merged ParameterChanges passed to the hosted processor",
        "Test: When DAW and MCP queue have changes for the SAME parameter, both changes are present (MCP appended after DAW)",
        "Test: When only DAW has changes (empty MCP queue), hosted processor sees only DAW changes",
        "Test: When only MCP queue has changes (empty DAW inputParameterChanges), hosted processor sees only MCP changes",
        "Test: After process() returns, the original inputParameterChanges pointer is restored on ProcessData (existing test, but verify it still works with the new tests)",
        "Build compiles without errors, all tests pass"
      ],
      "priority": 5,
      "passes": true,
      "notes": "The merging logic is in processor.cpp process() around lines 194-237. It copies DAW changes first, then appends queued MCP changes. The existing test ParamChangesInjectedIntoProcessData only tests MCP-only injection. The mock hosted processor's process lambda should capture and verify the merged ParameterChanges content. Use ParameterChanges/ParameterValueQueue from sdk_hosting for test setup."
    },
    {
      "id": "US-006",
      "title": "Test processor state replay during plugin load",
      "description": "As a developer, I want tests that verify the processor correctly replays DAW state (active, processing, bus arrangements, process setup) onto a newly loaded hosted plugin.",
      "acceptanceCriteria": [
        "Add tests in test_processor_lifecycle.cpp (or a new file if cleaner)",
        "Test: When wrapperActive_=true and a plugin is loaded via notify('LoadPlugin'), the hosted component receives setActive(true)",
        "Test: When wrapperProcessing_=true and a plugin is loaded, the hosted processor receives setProcessing(true)",
        "Test: When both wrapperActive_ and wrapperProcessing_ are true, the hosted plugin receives both calls in the correct order (setActive before setProcessing)",
        "Test: When wrapperActive_=false, the hosted component does NOT receive setActive(true) after loading",
        "Test: Stored bus arrangements from setBusArrangements() are replayed onto the hosted processor during loading",
        "Build compiles without errors, all tests pass"
      ],
      "priority": 6,
      "passes": true,
      "notes": "The replay logic is in processor.cpp after loadHostedPlugin() returns, in the notify('LoadPlugin') handler (around lines 339-356). Tests need to: 1) set wrapper state (call setActive/setProcessing on the wrapper), 2) trigger a load via notify(), 3) verify the mock hosted processor received the correct calls. The ProcessorTestAccess friend class may need new accessors."
    },
    {
      "id": "US-007",
      "title": "Test error paths in plugin loading",
      "description": "As a developer, I want tests that verify graceful behavior when plugin loading fails at various stages so that failures don't crash the DAW.",
      "acceptanceCriteria": [
        "Add tests in test_hostedplugin.cpp or a new test file",
        "Test: Loading a nonexistent .vst3 path returns failure and leaves the module in a clean state",
        "Test: After a failed load, a subsequent valid load still works (no stuck state)",
        "Test: Unloading when nothing is loaded is a safe no-op",
        "Test: Double-unload is a safe no-op",
        "Test: Loading a new plugin while one is already loaded cleanly replaces it (the old one is unloaded first)",
        "Build compiles without errors, all tests pass"
      ],
      "priority": 7,
      "passes": true,
      "notes": "These tests exercise HostedPluginModule::load() and unload() error paths. The module uses a real Module::create() call which will fail for nonexistent paths — that's the correct behavior to test (no mocking needed for this). Focus on verifying the singleton returns to a clean state after errors."
    },
    {
      "id": "US-008",
      "title": "Update documentation to reflect hardening changes",
      "description": "As a developer, I want CLAUDE.md and ARCHITECTURE.md to accurately reflect any changes made during hardening so that documentation stays in sync.",
      "acceptanceCriteria": [
        "If any new source files were created, add them to the Source Files table in CLAUDE.md",
        "If any test files were added/removed, verify the test count references are accurate or remove specific counts",
        "If error handling behavior changed (e.g., MCP server start), update the Known Limitations section",
        "If parameter validation behavior changed, update the MCP Tools section",
        "All documentation is accurate and internally consistent",
        "Build compiles without errors, all tests pass"
      ],
      "priority": 8,
      "passes": false,
      "notes": "The convention is: documentation must stay in sync with code. Run through CLAUDE.md and ARCHITECTURE.md checking every factual claim against the code. Previous stories in this PRD may have changed behavior — make sure docs reflect the new behavior."
    }
  ]
}
